app/views/pages/user.html.erb

  <div class="col s12 m8 l9">
    <% if @user.questions.count > 0 %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 3]]