app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("content", "question_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Yo"], ["question_id", 1], ["user_id", 2], ["created_at", "2015-11-02 08:11:01.018915"], ["updated_at", "2015-11-02 08:11:01.018915"]]
---
  def create
   @question = Question.find(params[:question_id])
   @answer = @question.answers.new(comment_params)
   @answer.user = current_user
   @answer.save