app/controllers/followers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "followers" ("follower_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["user_id", 1], ["created_at", "2015-11-03 18:44:12.808034"], ["updated_at", "2015-11-03 18:44:12.808034"]]
---
  def create
    user = User.find(params[:follower_id])
    @follower = user.followers.build(:follower_id => current_user.id)
    if @follower.save

SELECT  "followers".* FROM "followers" WHERE "followers"."user_id" = ? AND "followers"."follower_id" = ? LIMIT 1  [["user_id", 1], ["follower_id", 3]]
DELETE FROM "followers" WHERE "followers"."id" = ?  [["id", 3]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
  @follower = User.find(params[:id]).followers.find_by follower_id: current_user.id
  @follower.destroy