app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "followers".* FROM "followers" WHERE "followers"."follower_id" = ?  [["follower_id", 1]]
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = ?  [["user_id", 1]]
---
  def user
    @user = User.find(params[:id])
    @current_user = current_user
    @followings = Array.new
    followers = Follower.where(follower_id: @user.id)
    followers.each do |follower|