app/controllers/questions_controller.rb

SELECT "users".* FROM "users"
SELECT  "followers".* FROM "followers" WHERE "followers"."follower_id" = ? LIMIT 1  [["follower_id", 1]]
---
  def index
    if user_signed_in?
      @users = User.all
      @followings = Follower.where(follower_id: current_user.id)

INSERT INTO "questions" ("title", "content", "user_id", "upvotes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ROhan's first"], ["content", "What is my first question?"], ["user_id", 1], ["upvotes", 0], ["created_at", "2015-11-02 07:44:31.260111"], ["updated_at", "2015-11-02 07:44:31.260111"]]
---
  def create
    @question = Question.new(question_params)
    @question.user = current_user
    @question.upvotes = 0
    respond_to do |format|
      if @question.save

UPDATE "questions" SET "content" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["content", "Hello ??"], ["updated_at", "2015-11-02 07:52:54.305934"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)