app/controllers/question_upvotes_controller.rb

  def create
    question = Question.find(params[:id])
    upvoter = question.question_upvotes.build(:upvoter_id => current_user.id)
    if upvoter.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "question_upvotes" ("upvoter_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["upvoter_id", 1], ["question_id", 3], ["created_at", "2015-11-06 05:38:54.810306"], ["updated_at", "2015-11-06 05:38:54.810306"]]

  def destroy
    upvote = Question.find(params[:id]).question_upvotes.find_by upvoter_id: current_user.id
    upvote.destroy
---
SELECT  "question_upvotes".* FROM "question_upvotes" WHERE "question_upvotes"."question_id" = ? AND "question_upvotes"."upvoter_id" = ? LIMIT 1  [["question_id", 3], ["upvoter_id", 1]]
DELETE FROM "question_upvotes" WHERE "question_upvotes"."id" = ?  [["id", 1]]